In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.DataFrame([[2,np.nan,4],[np.nan,5,1],[5,6,7]])
data

     0    1  2
0  2.0  NaN  4
1  NaN  5.0  1
2  5.0  6.0  7

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
0    2 non-null float64
1    2 non-null float64
2    3 non-null int64
dtypes: float64(2), int64(1)
memory usage: 200.0 bytes

### 删除缺值  dropna()

In [4]:
#默认情况   以行为单位查看是否有缺值   只要有就删除改行
data.dropna()

     0    1  2
2  5.0  6.0  7

In [6]:
#以列为单位删除   添加axis参数   axis=0(行)  axis=1(列)  | ‘columns’
data.dropna(axis='columns')

   2
0  4
1  1
2  7

In [7]:
data.dropna(axis=1)

   2
0  4
1  1
2  7

In [8]:
#想所有数据为nan才删除  how = 'all'  默认是'any'
data

     0    1  2
0  2.0  NaN  4
1  NaN  5.0  1
2  5.0  6.0  7

In [9]:
data.dropna(how='all')

     0    1  2
0  2.0  NaN  4
1  NaN  5.0  1
2  5.0  6.0  7

In [10]:
data = pd.DataFrame([[2,np.nan,4],[np.nan,np.nan,1],[5,np.nan,7]])
data

     0   1  2
0  2.0 NaN  4
1  NaN NaN  1
2  5.0 NaN  7

In [11]:
#删除第二列   1.要以列为单位   2.所有为nan的删除
data.dropna(axis=1,how='all')

     0  2
0  2.0  4
1  NaN  1
2  5.0  7